
* MEETING with 刘飞亚 张立卫                                                    :MEETING:
- 固定阅读器适配器文档,加入适配器设计文档里
  - 施封
  - 解封
- 打印机打印两份,需要屈原协助测试实验
- 控件放服务器上,打成cab包,远程下载
[2017-05-04 Thu 15:20]

* TODO 与mobileorg集成,查阅orgmode文档附录B 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:15]--[2017-05-24 Wed 09:21] =>  0:06
:END:      
- 通过web浏览器访问mobileorg配置的webdav地址来验证webdav是否设置正确
- emacs如何访问webdav,是否与webdav客户端已经集成?
- mobileorg设置的webdav url是全路径,以orgmode的文件名结尾
[2017-05-24 Wed 09:15]
* TODO 12306购票电话修改,由原来的移动号码更改为目前使用的联通号码 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:21]--[2017-05-24 Wed 09:25] =>  0:04
:END:      
[2017-05-24 Wed 09:21]
* TODO 建行信用卡手机号变更 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:29]--[2017-05-24 Wed 09:30] =>  0:01
:END:      
[2017-05-24 Wed 09:28]
* TODO 中信银行手机号变更 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:30]--[2017-05-24 Wed 09:31] =>  0:01
:END:      
[2017-05-24 Wed 09:30]
* TODO 工商银行手机号变更 
[2017-05-24 Wed 09:31]
* TODO 建设银行手机号变更 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:31]--[2017-05-24 Wed 09:32] =>  0:01
:END:      
[2017-05-24 Wed 09:31]
* TODO 手机号话费单报销 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:32]--[2017-05-24 Wed 09:33] =>  0:01
:END:      
[2017-05-24 Wed 09:32]
* TODO 安装自行车铃铛 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:33]--[2017-05-24 Wed 09:34] =>  0:01
:END:      
[2017-05-24 Wed 09:33]
* TODO 安装自行车减震装饰 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:34]--[2017-05-24 Wed 09:35] =>  0:01
:END:      
[2017-05-24 Wed 09:34]
* TODO 更换自行车刹车皮 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:35]--[2017-05-24 Wed 09:36] =>  0:01
:END:      
[2017-05-24 Wed 09:35]
* TODO 清洗抽油烟机 
[2017-05-24 Wed 09:36]
* TODO 清理书架,找出需要处理掉的书籍 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:36]--[2017-05-24 Wed 09:37] =>  0:01
:END:      
[2017-05-24 Wed 09:36]
* TODO 编写简历 
:LOGBOOK:  
CLOCK: [2017-05-24 Wed 09:37]--[2017-05-24 Wed 09:38] =>  0:01
:END:      
[2017-05-24 Wed 09:37]
* MEETING with 阎毅 刘宏怀 王文 张唯                                            :MEETING:
:LOGBOOK:  
CLOCK: [2017-06-26 Mon 14:29]--[2017-06-26 Mon 15:20] =>  0:51
:END:      
[2017-06-26 Mon 14:29]
- 审图全局开关
- usb连接两个平板电脑进行通讯可能无法实现
* NEXT rfid适配器过滤重复的上报数据
  :LOGBOOK:  
  CLOCK: [2017-06-28 Wed 09:48]--[2017-06-28 Wed 09:49] =>  0:01
  CLOCK: [2017-06-27 Tue 08:55]--[2017-06-28 Wed 09:48] => 24:53
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2017-06-28 Wed 09:49]
| Headline                          | Time    |
|-----------------------------------+---------|
| *Total time*                      | *24:55* |
|-----------------------------------+---------|
| NEXT rfid适配器过滤重复的上报数据 | 24:55   |
#+END:

  CLOCK: [2017-06-27 Tue 08:54]--[2017-06-27 Tue 08:55] =>  0:01
  :END:      
[2017-06-27 Tue 08:48]

* TODO 修改日志文件名为可执行程序的文件名 
[2017-06-27 Tue 08:54]
* TODO 整理金坛所有适配器的安装部署文档,提供给宋丹阳 
[2017-06-27 Tue 08:54]
* TODO git submodule 管理,使用 
  :LOGBOOK:  
  CLOCK: [2017-06-29 Thu 11:46]--[2017-06-29 Thu 11:48] =>  0:02
  :END:      
[2017-06-29 Thu 11:46]
* TODO 研究如何将其他编码格式的源文件批量统一转换为utf8 
  :LOGBOOK:  
  CLOCK: [2017-06-29 Thu 14:40]--[2017-06-29 Thu 14:41] =>  0:01
  :END:      
[2017-06-29 Thu 14:40]
* TODO 更改gmail绑定的手机号 
[2017-06-29 Thu 14:42]
* TODO software proxychains-ng for arch linux 
  :LOGBOOK:  
  CLOCK: [2017-07-06 Thu 09:32]--[2017-07-06 Thu 09:34] =>  0:02
  :END:      
[2017-07-06 Thu 09:32]
proxychains 可以将tcp代理转换为http代理
* TODO emacs 学习资料 tuhdo.githu.io 
  :LOGBOOK:  
  CLOCK: [2017-07-06 Thu 11:25]--[2017-07-06 Thu 11:27] =>  0:02
  :END:      
[2017-07-06 Thu 11:25]
